In [1]:
# Write a python code to create a .csv file
import pandas as pd
import xlrd

In [2]:
data = {
    'emp_id' : [101,102,103,104],
    'emp_name' : ['Aman','Deepak','Deva','Gopi'],
    'departement':['Developement','Management','Testing','HR'],
    'salary':[1500000,1200000,230000,980000]
}

df = pd.DataFrame(data)
# df or print(df)
df

   emp_id emp_name   departement   salary
0     101     Aman  Developement  1500000
1     102   Deepak    Management  1200000
2     103     Deva       Testing   230000
3     104     Gopi            HR   980000

In [3]:
df.to_csv('employee.csv',index=False)
print('Data is saved successfully')

Data is saved successfully

In [4]:
# How to read csv file ?
# Read .csv file

newDf = pd.read_csv('student_info.csv')
newDf

     study_hours  student_marks
0           6.83          78.50
1           6.56          76.74
2            NaN          78.68
3           5.67          71.82
4           8.67          84.19
..           ...            ...
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

[200 rows x 2 columns]

In [5]:
print(pd)

<module 'pandas' from '/usr/local/lib/python3.6/dist-packages/pandas/__init__.py'>

In [6]:
print(df.dtypes)

emp_id          int64
emp_name       object
departement    object
salary          int64
dtype: object

In [7]:
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [8]:
print(df.values)

[[101 'Aman' 'Developement' 1500000]
 [102 'Deepak' 'Management' 1200000]
 [103 'Deva' 'Testing' 230000]
 [104 'Gopi' 'HR' 980000]]

In [9]:
# Shape property of DataFrame is use to display shape

newDf.shape

(200, 2)

In [10]:
# head() :- head() of DataFrame display top 5 rows

newDf.head()

   study_hours  student_marks
0         6.83          78.50
1         6.56          76.74
2          NaN          78.68
3         5.67          71.82
4         8.67          84.19

In [11]:
# tail() :- tail() function of DataFrame display last five rows 
newDf.tail()

     study_hours  student_marks
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

In [12]:
# series :- series is a data structure in pandas . It work like one dimensional array
import numpy as np

In [13]:
series = pd.Series(np.random.rand(50))
series

0     0.005048
1     0.686146
2     0.636649
3     0.007536
4     0.522415
5     0.992744
6     0.830930
7     0.417058
8     0.579880
9     0.761021
10    0.594434
11    0.585878
12    0.062544
13    0.553381
14    0.150767
15    0.383131
16    0.368956
17    0.101964
18    0.785267
19    0.760421
20    0.831553
21    0.044263
22    0.184542
23    0.892609
24    0.512902
25    0.267171
26    0.351940
27    0.983229
28    0.833576
29    0.296388
30    0.801004
31    0.676154
32    0.728950
33    0.652686
34    0.288987
35    0.468593
36    0.656405
37    0.491670
38    0.400273
39    0.043280
40    0.869563
41    0.861374
42    0.135772
43    0.006304
44    0.393999
45    0.399615
46    0.707843
47    0.117839
48    0.600624
49    0.793673
dtype: float64

In [14]:
type(series)

pandas.core.series.Series

In [15]:
dataframe = pd.DataFrame(np.random.rand(100,5))
dataframe

           0         1         2         3         4
0   0.982428  0.447214  0.882798  0.552370  0.254678
1   0.846267  0.936584  0.603626  0.483965  0.837761
2   0.732698  0.244621  0.523392  0.058406  0.368812
3   0.468448  0.582804  0.307686  0.659621  0.590695
4   0.507646  0.140724  0.591848  0.107016  0.085138
..       ...       ...       ...       ...       ...
95  0.263584  0.999391  0.241897  0.749822  0.571626
96  0.709267  0.597085  0.389185  0.670523  0.363556
97  0.627239  0.514291  0.012419  0.413378  0.328797
98  0.425359  0.603059  0.972697  0.934497  0.874047
99  0.593583  0.617431  0.844788  0.242446  0.946177

[100 rows x 5 columns]

In [16]:
dataframe = pd.DataFrame({
    'number': np.random.rand(5)
})
dataframe

     number
0  0.781031
1  0.849504
2  0.663989
3  0.609384
4  0.382357

In [17]:
dataframe.dtypes

number    float64
dtype: object

In [18]:
dataframe.head()

     number
0  0.781031
1  0.849504
2  0.663989
3  0.609384
4  0.382357

In [19]:
newDf.describe()

       study_hours  student_marks
count   195.000000      200.00000
mean      6.995949       77.93375
std       1.253060        4.92570
min       5.010000       68.57000
25%       5.775000       73.38500
50%       7.120000       77.71000
75%       8.085000       82.32000
max       8.990000       86.99000

In [20]:
# How to read xlsx file

excelData = pd.read_excel('students.xlsx')
excelData

AttributeError: module 'pandas' has no attribute 'read_xlsx'